# p.118 구현
# 실전 4-2 게임 개발


# N * M 사이즈 입력
N, M = map(int, input().split())

# 캐릭터 좌표(A,B), 바라보는 방향 입력
A, B, d = map(int, input().split())

# 맵 지형 입력 
array = []
for i in range(N) :  # input을 N번 실행
    temp = input()
    array.append(temp)   # input 입력 값을 2차원 리스트로 합치기


# 매뉴얼 구현

# while( ! 변수가 4 and 뒤가 바다 ) :
    # cant = 0

# 왼쪽 방향부터 간다.
    # d = d-1
# 왼쪽 방향 갈 수 있는지 따지고 전진하는 함수(). (d 값에 따라 좌표(A,B) 설정) 

# 왼쪽 방향 못 가면 다시 왼쪽으로 회전한다.(cant = cant + 1) 
# 이미 지나간 곳은 표시를 해두자. array[A][B] = "x"
# 그렇게 돌아서 모든 방향이 못 가는 곳이면(if로 구현, 못 가는 여부는 변수값 4), 뒤로 한 칸가거나, 뒤가 바다이면(d기준으로 판단) 그냥 끝낸다.


#왼쪽 따져서 전진하는 함수()
# d가 0이면 y가 위 좌표가 0이면 감
# d가 3이면 x가 왼쪽 좌표가 0이면 감
# d가 2이면 x가 오른쪽 좌표가 0이면 감
# d가 1이면 y가 아래 좌표가 0이면 감

x = 1
y = 2
array = [[1,2,3], [4,5,6]]

print(array[x][y])